АлогистикТест2/src/Documents/алк_УстановкаПараметровКатегорииПЭО/алк_УстановкаПараметровКатегорииПЭО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаПараметровКатегорииПЭО</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставлениеСоставаКатегорииПЭО</name>
    <attributes>
      <name>ДлинаСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СечениеСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПородаСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКатегорииПЭО</name>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>CatalogRef.Влажность</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>350</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаПараметровКатегорииПЭО/Forms/ФормаСоставаКатегорииПЭО/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("ПараметрыЗаполнения") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыЗаполнения);
	Если Параметры.ПараметрыЗаполнения.Свойство("МассивСостава") Тогда
		Для Каждого элемент из Параметры.ПараметрыЗаполнения.МассивСостава Цикл
			СтрокаСостава = Состав.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаСостава, элемент);
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоставКатегорииПЭО(Команда)
	Результат = Новый Структура("Ключ,МассивСостава"
	,Ключ
	,ПолучитьМассивСостава());
	
	Закрыть(Результат);
КонецПроцедуры 

&НаСервере
Функция ПолучитьМассивСостава()
	// удаляем пустые строки
	ПустыеСтроки = Состав.НайтиСтроки(Новый Структура ("Длина,Сечение,Порода,Влажность"
	,Справочники.Длины.ПустаяСсылка()
	,Справочники.РазмерСечения.ПустаяСсылка()
	,Справочники.Породы.ПустаяСсылка()
	,Справочники.Влажность.ПустаяСсылка()));
	
	Для Каждого эл ИЗ ПустыеСтроки Цикл 
		Состав.Удалить(эл);
	КонецЦикла;
	//\\
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Состав.Выгрузить());	
КонецФункции

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	Закрыть();
КонецПроцедуры
